{
  "departments": [
    {
      "id": 5001,
      "image": "https://firebasestorage.googleapis.com/v0/b/traineepath-101fd.appspot.com/o/History-Book-PNG.png?alt=media&token=086d6bdc-56d4-4f42-a668-d49c9248e628",
      "title": "Tarih",
      "topics": [
        10001,
        10002
      ]
    }
  ],
  "main_topics": [
    {
      "id": 10001,
      "image": "https://via.placeholder.com/150",
      "title": "Rika Yazı Türünün Özellikleri",
      "sub_topics": [
        {
          "title": "Rika Yazısı nedir?",
          "subtitle": "nedir?",
          "content": {
            "image": "",
            "mainTitle": "",
            "title": "RİK’A YAZI TÜRÜ NEDİR??",
            "titleContent": " Kelime anlamı olarak ‘deri parçası’ anlamına gelen rik’a Nesih yazı türünün daha yuvarlak ve kıvrak haline dönüşmesi ile ortaya çıkmıştır. Arap harfleri ile en çok kullanılan yazı biçimidir. Nesih gibi küçük yazılan ve Tevki’nin kurallarına bağlı olan rik’a genel olarak vakıf işlerinde kullanılırdı. ",
            "subtitle": "",
            "subtitleContent": "",
            "video": ""
          }
        },
        {
          "title": "Rika Yazısının ortaya Çıkışı",
          "subtitle": "",
          "content": {
            "image": "",
            "mainTitle": "",
            "title": "RİK’A YAZI TÜRÜNÜN ORTAYA ÇIKIŞI",
            "titleContent": "Rik’a yazı türünün ortaya çıkışıyla ilgili çok net kaynaklar olmamakla beraber tahminlere göre Dulkadiroğulları döneminde ortaya çıkmıştır. Daha sonra Osmanlı’da Divan-ı Hümayun’da boylarını küçültülüp, sadeleştirip, kavis ve meyillerinin azaltılmasıyla belirli kurallara bağlanmıştır. Önceleri vakıf işlerinde kullanılan  bu yazı türü 19. yüzyıldan sonra günlük hayatta ve mektuplaşmalarda da kullanılmaya başlandı. ",
            "subtitle": "",
            "subtitleContent": "",
            "video": ""
          }
        },
        {
          "title": "Rika Yazısının Gelişimi",
          "subtitle": "",
          "content": {
            "image": "",
            "mainTitle": "",
            "title": "RİK’A YAZI TÜRÜNÜN GELİŞİMİ",
            "titleContent": " En eski örneklerinin 18. yüzyılda görüldüğü ve Osmanlı saraylarında şekillenen bu yazı biçimi günlük hayatta kullanılmaya başlandıktan sonra devlet dairelerinin de bir parçası olmuştu. Ancak rik’a gelişimini ve asıl kimliğini Babıali’de bulmuştur. Babıali’de çalışan memurların yazdığı rik’aları Mümtaz Efendi tarafından belirli kurallara bağlanmıştır ancak bu üslubu sonradan gelenler uygulayabildi. Bu yüzden Babıali’nin eski memurlarının yazdığı rik’a ve Mümtaz Efendi’nin rik’ası arasında bir farklılık oluştu. Mümtaz Efendi’den sonra da birçok hat hocası yeni tarzlar denemiştir fakat bunlardan en çok tercih edileni sanatsal yönünün yüksek olması sebebiyle İzzet Efendi’nin rik’ası olmuştur. Bu süreçte basitliği sebebiyle diğer İslam ülkelerinde de hızla yayılan rik’a Harf Devriminden sonra Latin alfabesine geçişle ortadan kalkmıştır. Şuan anadili Arapça olan ülkelerde yaygın olarak kullanılıyor olmasına rağmen günümüz Türkiye’sinde sadece bazı hattatlar tarafından icra ediliyor. ",
            "subtitle": "",
            "subtitleContent": "",
            "video": ""
          }
        }
      ]
    },
    {
      "id": 10002,
      "image": "https://via.placeholder.com/150",
      "title": "Rika hattıyla yazılmış belge okuma",
      "sub_topics": [
        {
          "title": "Arşiv Okuma",
          "subtitle": "",
          "content": {
            "image": "",
            "mainTitle": "",
            "title": "ARŞİV OKUMA TEKNİKLERİ",
            "titleContent": " Zafer Şık tarafından hazırlanmış Osmanlıca Arşiv Okumaları’nda da söylediği üzere arşiv okurken öncelikle mutlaka lügat kullanılmalı. Aynı okuma arşivinde Serkan Kol’un çevirdiği metnin örneğini aşağıda bulabilirsiniz. ",
            "subtitle": "Belgenin çevirisi",
            "subtitleContent": "Devletlü Ġnâyetlü Merhametlü Atufetlü EfendimhHazretleri sağ olsun Gümülcine‘de haber verilen mâdenî îmal tecrübe içün tayin olunan Muhammed emin kullarından gelen tahrîrâtın hülasân mefhûmlarında bir fırından hâsıl olacaky edi yüz dirhem sîm-i hamın kıymete hatab ve kömür masârıfından kat‘-ı nâzar timurî bozan hamulesinin ücretine vefâ etmeyeceği müstefad ve mübeyyin olmağla keyfiyet mâlûm-ı devletleri buyruldukda külliyen mâdenî terk idüp mâdenci zimmetleri ile cümlesinin avd u insiraflarına izn ve müsâade-i âlîyyeleri erzânî buyrulduğunu müĢ‘ar emr-î celîlü‘Ģ-Ģan inâyet ve ihsan buyrulur ise emr u fermân devletlü inayetlü atufetlü efendim sultanım hazretlerinindir. Bende el-hac Mustafa sarfı emin darphâne âmire hala ",
            "video": ""
          }
        },
        {
          "title": "Lügat",
          "subtitle": "",
          "content": {
            "image": "https://firebasestorage.googleapis.com/v0/b/traineepath-101fd.appspot.com/o/arb.png?alt=media&token=5724eb72-dd2e-4ade-9a3b-2732cb71ba55",
            "mainTitle": "",
            "title": "Lügat",
            "titleContent": "Îmal: İşlemek, icra etmek\nTe’min: Bir iş için gerekli olan şartları hazırlama, sağlama\nEmin: Güvenilir, inanılır, itimat edilir kimse.\nTahrîrât:Resmi dairelerde yapılan yazışmalar\nHülasân: Bir sözün veya yazının özünü belirten kısaltılmış şekli.\nMefhûm: Bir sözün veya kelimenin taşıdığı, ifade ettiği mana, anlam, kavram.\nDirhem: Okkanın dört yüzd birine eşit eski bir ağırlık ölçüsü birimi.\nMasarıfat: Harcanan, sarf edilen paralar, masraflar.\nNâzır: Bakan, nazar eden.\nHumule: Bir yük veya eşyânın taşıyan deve.\nİnsiraf: Geri dönme.\nErzânî: Layık, değer,uygun.\nMeş’ar: Hacca gidenlerin bu ibâdetle ilgili birtakım görevleri yerine getirmek için bir müddet durdukları, kaldıkları yerlerden her biri, durak yeri.\n",
            "subtitle": "",
            "subtitleContent": "",
            "video": ""
          }
        }
      ]
    }
  ]
}